4566z1/STM32_Warehouse/Core/Src/bsp_USART.c
/***********************************************************************************************************************************
 ** 【代码编写】  魔女开发板团队
 ** 【代码更新】
 ** 【淘    宝】  魔女开发板      https://demoboard.taobao.com
 ***********************************************************************************************************************************
 **【文件名称】  bsp_usart.c
 **
 **【文件功能】  各USART的GPIO配置、通信协议配置、中断配置，及功能函数实现
 **
 **【适用平台】  STM32F103 + HAL库 + keil5
 **
************************************************************************************************************************************/
#include "bsp_USART.h"    // 头文件
#include <stdarg.h>       // 用于支持不定长参数






/*****************************************************************************
 ** 声明本地变量
****************************************************************************/
typedef struct
{
    uint16_t  ReceivedNum;                       // 新一帧数据，接收到多少个字节数据
    uint8_t   ReceivedData[USART1_RX_BUF_SIZE];  // 新一帧数据，数据缓存; 存放的是空闲中断后，从临时接收缓存复制过来的完整数据，并非接收过程中的不完整数据;

    uint8_t   txFiFoData[USART1_TX_BUF_SIZE];    // 发送缓冲区，环形队列; 为了方便理解阅读，没有封装成队列函数
    uint16_t  txFiFoHead ;                       // 环形缓冲区的队头
    uint16_t  txFiFoTail ;                       // 环形缓冲区的队尾
} xUSATR_TypeDef;



static xUSATR_TypeDef  xUSART1 = { 0 };          // 定义 USART1 的收发结构体
static xUSATR_TypeDef  xUSART2 = { 0 };          // 声明为全局变量,方便记录信息、状态
static xUSATR_TypeDef  xUSART3 = { 0 };          // 声明为全局变量,方便记录信息、状态
static xUSATR_TypeDef  xUART4  = { 0 };          // 声明为全局变量,方便记录信息、状态
static xUSATR_TypeDef  xUART5  = { 0 };          // 声明为全局变量,方便记录信息、状态
static xUSATR_TypeDef  xUSART6 = { 0 };          // 声明为全局变量,方便记录信息、状态





//////////////////////////////////////////////////////////////   USART-1   //////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#if USART1_EN

/******************************************************************************
 * 函  数： USART1_Init
 * 功  能： 初始化USART1的通信引脚、协议参数、中断优先级
 *          引脚：TX-PA10、RX-PA11
 *          协议：波特率-None-8-1
 *          发送：发送中断
 *          接收：接收+空闲中断
 *
 * 参  数： uint32_t  baudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
void USART1_Init(uint32_t baudrate)
{
    // 使能相关时钟
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;                     // 使能外设：USART1
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;                      // 使能GPIO：GPIOA

    // 关闭串口
    USART1 -> CR1  =   0;                                     // 关闭串口，配置清零

    // 计算波特率参数
    float    temp;
    uint16_t mantissa, fraction;
    SystemCoreClockUpdate();                                  // 更新系统运行频率全局值; 函数SystemCoreClock( )，在标准库、HAL库通用
    temp = (float)(SystemCoreClock / 2) / (baudrate * 16);    // 波特率公式计算; USART1挂载在APB2, 时钟为系统时钟的2分频; 全局变量SystemCoreClock，在标准库、HAL库通用;
    mantissa = temp;				                          // 整数部分
    fraction = (temp - mantissa) * 16;                        // 小数部分
    USART1 -> BRR  = mantissa << 4 | fraction;                // 设置波特率

    // 串口通信参数配置
    USART1 -> CR1 |=   0x01 << 2;                             // 接收使能[2]: 0=失能、1=使能
    USART1 -> CR1 |=   0x01 << 3;                             // 发送使能[3]：0=失能、1=使能
    USART1 -> CR1 &= ~(0x01 << 12);                           // 数据位[12]：0=8位、1=9位
    USART1 -> CR2  =   0;                                     // 数据清0
    USART1 -> CR2 &=  ~(0x03 << 12);                          // 停止位[13:12]：00b=1个停止位、01b=0.5个停止位、10b=2个停止位、11b=1.5个停止位
    USART1 -> CR3  =   0;                                     // 数据清0
    USART1 -> CR3 &= ~(0x01 << 6);                            // DMA接收[6]: 0=禁止、1=使能
    USART1 -> CR3 &= ~(0x01 << 7);                            // DMA发送[7]: 0=禁止、1=使能

    // GPIO引脚工作模式配置
    GPIO_InitTypeDef    GPIO_InitStruct = {0};                // 声明初始化要用到的结构体
    GPIO_InitStruct.Pin   = GPIO_PIN_9 | GPIO_PIN_10;         // 引脚 TX-PA2、RX-PA3
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;                  // 工作模式
    GPIO_InitStruct.Pull  = GPIO_PULLUP;                      // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;        // 引脚速率
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;              // 引脚复用功能
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);                   // 初始化引脚工作模式

    // 中断优选级配置
#if 1                                                         // 使用HAL库进行配置
    HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);                  // 配置中断线的优先级
    HAL_NVIC_EnableIRQ(USART1_IRQn);                          // 使能中断线
#else                                                         // 使用寄存器操作，以方便文件复制移植
    NVIC->IP[USART1_IRQn] &= ~(0xF << 4);                     // 设置优先级，直接设置为0、0; 如果需要修改优先级，可以使用上面一段HAL库代码进行配置
    NVIC->ISER[USART1_IRQn / 32] |= 1 << (USART1_IRQn % 32);  // 使能中断通道
#endif

    // 串口中断设置
    USART1->CR1 &= ~(0x01 << 7);                              // 关闭发送中断
    USART1->CR1 |= 0x01 << 5;                                 // 使能接收中断: 接收缓冲区非空
    USART1->CR1 |= 0x01 << 4;                                 // 使能空闲中断：超过1字节时间没收到新数据
    USART1->SR   = ~(0x00F0);                                 // 清理中断

    USART1 -> CR1 |= 0x01 << 13;                              // 使能USART开始工作

    printf("\r\r\r===========  STM32F407VE 外设初始报告 ===========\r");                   // 输出到串口助手
    SystemCoreClockUpdate();                                                               // 更新一下系统运行频率变量
    printf("系统时钟频率          %d MHz\r", SystemCoreClock / 1000000);                   // 输出到串口助手
    printf("USART1初始化配置      %d-None-8-1; 已完成初始化配置、收发配置\r", baudrate);   // 输出到串口助手
}

/******************************************************************************
 * 函  数： USART1_IRQHandler
 * 功  能： USART1的接收中断、空闲中断、发送中断
 * 参  数： 无
 * 返回值： 无
 * 备  注： 本函数，当产生中断事件时，由硬件调用。
 *          如果使用本文件代码，在工程文件的其它地方，要注释同名函数，否则冲突。
******************************************************************************/
void USART1_IRQHandler(void)
{
    static uint16_t cnt = 0;                                         // 接收字节数累计：每一帧数据已接收到的字节数
    static uint8_t  rxTemp[USART1_RX_BUF_SIZE];                      // 接收数据缓存数组：每新接收１个字节，先顺序存放到这里，当一帧接收完(发生空闲中断), 再转存到全局变量：xUSART.ReceivedData[xx]中；

