4566z1/STM32_Warehouse/Core/Src/bsp_USART.c
/******************************************************************************
 * 函  数： UART5_IRQHandler
 * 功  能： USART2的接收中断、空闲中断、发送中断
 * 参  数： 无
 * 返回值： 无
 * 备  注： 本函数，当产生中断事件时，由硬件调用。
 *          如果使用本文件代码，在工程文件的其它地方，要注释同名函数，否则冲突。
 ******************************************************************************/
void UART5_IRQHandler(void)
{
    static uint16_t cnt = 0;                                       // 接收字节数累计：每一帧数据已接收到的字节数
    static uint8_t  rxTemp[UART5_RX_BUF_SIZE];                     // 接收数据缓存数组：每新接收１个字节，先顺序存放到这里，当一帧接收完(发生空闲中断), 再转存到全局变量：xUSART.USARTxReceivedData[xx]中；

    // 发送中断：用于把环形缓冲的数据，逐字节发出
    if ((UART5->SR & 1 << 7) && (UART5->CR1 & 1 << 7))             // 检查TXE(发送数据寄存器空)、TXEIE(发送缓冲区空中断使能)
    {
        UART5->DR = xUART5.txFiFoData[xUART5.txFiFoTail++];        // 把要发送的字节，放入USART的发送寄存器
        if (xUART5.txFiFoTail == UART5_TX_BUF_SIZE)                // 如果数据指针到了尾部，就重新标记到0
            xUART5.txFiFoTail = 0;
        if (xUART5.txFiFoTail == xUART5.txFiFoHead)
            UART5->CR1 &= ~(1 << 7);                               // 已发送完成，关闭发送缓冲区空置中断 TXEIE
        return;
    }

    // 接收中断：用于挨个字节接收，存放到临时缓存
    if (UART5->SR & (1 << 5))                                      // 检查RXNE(读数据寄存器非空标志位); RXNE中断清理方法：读DR时自动清理；
    {
        if ((cnt >= UART5_RX_BUF_SIZE))//||xUART5.ReceivedFlag==1  // 判断1: 当前帧已接收到的数据量，已满(缓存区), 为避免溢出，本包后面接收到的数据直接舍弃．
        {
            // 判断2: 如果之前接收好的数据包还没处理，就放弃新数据，即，新数据帧不能覆盖旧数据帧，直至旧数据帧被处理．缺点：数据传输过快于处理速度时会掉包；好处：机制清晰，易于调试
            UART5->DR;                                             // 读取数据寄存器的数据，但不保存．主要作用：读DR时自动清理接收中断标志；
            return;
        }
        rxTemp[cnt++] = UART5->DR ;                                // 把新收到的字节数据，顺序存放到RXTemp数组中；注意：读取DR时自动清零中断位
        return;
    }

    // 空闲中断：用于判断一帧数据结束，整理数据到外部备读
    if (UART5->SR & (1 << 4))                                      // 检查IDLE(空闲中断标志位); IDLE中断标志清理方法：序列清零，USART1 ->SR;  USART1 ->DR;
    {
        xUART5.ReceivedNum  = 0;                                   // 把接收到的数据字节数清0
        memcpy(xUART5.ReceivedData, rxTemp, UART5_RX_BUF_SIZE);    // 把本帧接收到的数据，存放到全局变量xUSART.USARTxReceivedData中, 等待处理; 注意：复制的是整个数组，包括0值，以方便字符串数据
        xUART5.ReceivedNum  = cnt;                                 // 把接收到的字节数，存放到全局变量xUSART.USARTxReceivedCNT中；
        cnt = 0;                                                   // 接收字节数累计器，清零; 准备下一次的接收
        memset(rxTemp, 0, UART5_RX_BUF_SIZE);                      // 接收数据缓存数组，清零; 准备下一次的接收
        UART5 ->SR;
        UART5 ->DR;                                                // 清零IDLE中断标志位!! 序列清零，顺序不能错!!
        return;
    }

    return;
}

/******************************************************************************
 * 函  数： UART5_SendData
 * 功  能： UART通过中断发送数据
 *         【适合场景】本函数可发送各种数据，而不限于字符串，如int,char
 *         【不 适 合】注意h文件中所定义的发缓冲区大小、注意数据压入缓冲区的速度与串口发送速度的冲突
 * 参  数： uint8_t* data     需发送数据的地址
 *          uint8_t  num      发送的字节数 ，数量受限于h文件中设置的发送缓存区大小宏定义
 * 返回值： 无
 ******************************************************************************/
void UART5_SendData(uint8_t *data, uint16_t num)
{
    for (uint16_t i = 0; i < num; i++)                     // 把数据放入环形缓冲区
    {
        xUART5.txFiFoData[xUART5.txFiFoHead++] = data[i];  // 把字节放到缓冲区最后的位置，然后指针后移
        if (xUART5.txFiFoHead == UART5_TX_BUF_SIZE)        // 如果指针位置到达缓冲区的最大值，则归0
            xUART5.txFiFoHead = 0;
    }

    if ((UART5->CR1 & 1 << 7) == 0)                        // 检查USART寄存器的发送缓冲区空置中断(TXEIE)是否已打开
        UART5->CR1 |= 1 << 7;                              // 打开TXEIE中断
}

/******************************************************************************
 * 函  数： UART5_SendString
 * 功  能： 发送字符串
 *          用法请参考printf，及示例中的展示
 * 参  数： const char *mString, ...   不定长参数，请参考printf用法
 * 返回值： 无
 ******************************************************************************/
void UART5_SendString(const char *mString, ...)
{
    static char mBuffer[UART5_TX_BUF_SIZE];                // 开辟一个缓存; 只开辟一次，有效期直到程序结束; 缓存大小跟随发送环形缓冲区大小，在h文件中指定
    memset(mBuffer, 0, UART5_TX_BUF_SIZE);                 // 清0缓存数据

    va_list ap;                                            // 新建一个可变参数列表
    va_start(ap, mString);                                 // 列表指向第一个可变参数
    vsnprintf(mBuffer, UART5_TX_BUF_SIZE, mString, ap);    // 把所有参数，按格式，输出到缓存
    va_end(ap);                                            // 清空可变参数列表

    uint8_t *mChar = (uint8_t *)mBuffer;                   // 新建一个指针，指向缓存
    while (*mChar)                                         // 逐个字节检查，如果不为'\0', 即非0
        UART5_SendData(mChar++, 1);                        // 把字节存放环形缓冲，排队准备发送
}

/******************************************************************************
 * 函  数： UART5_GetReceivedNum
 * 功  能： 获取最新一帧数据的字节数
 * 参  数： 无
 * 返回值： 0=没有接收到数据，非0=新一帧数据的字节数
 ******************************************************************************/
uint16_t UART5_GetReceivedNum(void)
{
    return xUART5.ReceivedNum ;
}

/******************************************************************************
 * 函  数： UART5_GetReceivedData
 * 功  能： 获取最新一帧数据的缓存地址
 * 参  数： 无
 * 返回值： 数据的地址(uint8_t*)
 ******************************************************************************/
uint8_t *UART5_GetReceivedData(void)
{
    return xUART5.ReceivedData ;
}

/******************************************************************************
 * 函  数： UART5_ClearReceived
 * 功  能： 清理最后一帧数据的缓存
 *          主要是清0字节数，因为它是用来判断接收的标准
 * 参  数： 无
 * 返回值： 无
 ******************************************************************************/
void UART5_ClearReceived(void)
{
    xUART5.ReceivedNum = 0 ;
}
#endif   // END UART5





//////////////////////////////////////////////////////////////   USART-6   //////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#if USART6_EN

/******************************************************************************
 * 函  数： USART6_Init
 * 功  能： 初始化USART6的通信引脚、协议参数、中断优先级
 *          引脚：TX-PC6、RX-PC7
 *          协议：波特率-None-8-1
 *          发送：发送中断
 *          接收：接收+空闲中断
 *
 * 参  数： uint32_t baudrate  通信波特率
 * 返回值： 无
 ******************************************************************************/
void USART6_Init(uint32_t baudrate)
{
    // 使能相关时钟
    RCC->APB2ENR |= RCC_APB2ENR_USART6EN;                     // 使能外设：USART6
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;                      // 使能GPIO：GPIOC

    // 关闭串口
    USART6 -> CR1  =   0;                                     // 关闭串口，配置清零

    // 波特率
    float    temp;
    uint16_t mantissa, fraction;
    SystemCoreClockUpdate();                                  // 更新系统运行频率全局值; 函数SystemCoreClock( )，在标准库、HAL库通用
    temp = (float)(SystemCoreClock / 2) / (baudrate * 16);    // 波特率公式计算; USART6挂载在APB2, 时钟为系统时钟的2分频; 全局变量SystemCoreClock，在标准库、HAL库通用;
    mantissa = temp;				                          // 整数部分
    fraction = (temp - mantissa) * 16;                        // 小数部分
    USART6 -> BRR  = mantissa << 4 | fraction;                // 设置波特率

    // 通信参数配置
    USART6 -> CR1 |=   0x01 << 2;                             // 接收使能[2]: 0=失能、1=使能
    USART6 -> CR1 |=   0x01 << 3;                             // 发送使能[3]：0=失能、1=使能
    USART6 -> CR1 &= ~(0x01 << 12);                           // 数据位[12]：0=8位、1=9位
    USART6 -> CR2  =   0;                                     // 数据清0
    USART6 -> CR2 &=  ~(0x03 << 12);                          // 停止位[13:12]：00b=1个停止位、01b=0.5个停止位、10b=2个停止位、11b=1.5个停止位
    USART6 -> CR3  =   0;                                     // 数据清0
    USART6 -> CR3 &= ~(0x01 << 6);                            // DMA接收[6]: 0=禁止、1=使能
    USART6 -> CR3 &= ~(0x01 << 7);                            // DMA发送[7]: 0=禁止、1=使能

    // GPIO引脚工作模式配置
    GPIO_InitTypeDef    GPIO_InitStruct = {0};                // 声明初始化要用到的结构体
    GPIO_InitStruct.Pin   = GPIO_PIN_6 | GPIO_PIN_7;          // 引脚 TX-PC6、RX-PC7
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;                  // 工作模式
    GPIO_InitStruct.Pull  = GPIO_PULLUP;                      // 上下拉
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;        // 引脚速率
    GPIO_InitStruct.Alternate = GPIO_AF8_USART6;              // 引脚复用功能
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);                   // 初始化引脚工作模式

    // 中断优选级配置
#if 1                                                         // 使用HAL库进行配置
    HAL_NVIC_SetPriority(USART6_IRQn, 0, 0);                  // 配置中断线的优先级
    HAL_NVIC_EnableIRQ(USART6_IRQn);                          // 使能中断线
#else                                                         // 使用寄存器操作，以方便复制移植
    NVIC->IP[USART6_IRQn] &= ~(0xF << 4);                     // 设置优先级，直接设置为0、0
    NVIC->ISER[USART6_IRQn / 32] |= 1 << (USART6_IRQn % 32);  // 使能中断通道
#endif

    // 串口中断设置
    USART6->CR1 &= ~(0x01 << 7);                              // 关闭发送中断
    USART6->CR1 |= 0x01 << 5;                                 // 使能接收中断: 接收缓冲区非空
    USART6->CR1 |= 0x01 << 4;                                 // 使能空闲中断：超过1字节时间没收到新数据
    USART6->SR   = ~(0x00F0);                                 // 清理中断

    USART6 -> CR1 |= 0x01 << 13;                              // 使能USART开始工作
    printf("USART6初始化配置      %d-None-8-1; 已完成初始化配置、收发配置\r", baudrate);
}

