4566z1/STM32_Warehouse/Core/Src/bsp_USART.c
/******************************************************************************
 * 函  数： USART6_IRQHandler
 * 功  能： USART1的接收中断、空闲中断、发送中断
 * 参  数： 无
 * 返回值： 无
 *
******************************************************************************/
void USART6_IRQHandler(void)
{
    static uint16_t cnt = 0;                                         // 接收字节数累计：每一帧数据已接收到的字节数
    static uint8_t  rxTemp[USART6_RX_BUF_SIZE];                      // 接收数据缓存数组：每新接收１个字节，先顺序存放到这里，当一帧接收完(发生空闲中断), 再转存到全局变量：xUSART.USARTxReceivedData[xx]中；

    // 发送中断：用于把环形缓冲的数据，逐字节发出
    if ((USART6->SR & 1 << 7) && (USART6->CR1 & 1 << 7))             // 检查TXE(发送数据寄存器空)、TXEIE(发送缓冲区空中断使能)
    {
        USART6->DR = xUSART6.txFiFoData[xUSART6.txFiFoTail++];       // 把要发送的字节，放入USART的发送寄存器
        if (xUSART6.txFiFoTail == USART6_TX_BUF_SIZE)                // 如果数据指针到了尾部，就重新标记到0
            xUSART6.txFiFoTail = 0;
        if (xUSART6.txFiFoTail == xUSART6.txFiFoHead)
            USART6->CR1 &= ~(1 << 7);                                // 已发送完成，关闭发送缓冲区空置中断 TXEIE
        return;
    }

    // 接收中断：用于挨个字节接收，存放到临时缓存
    if (USART6->SR & (1 << 5))                                       // 检查RXNE(读数据寄存器非空标志位); RXNE中断清理方法：读DR时自动清理；
    {
        if ((cnt >= USART6_RX_BUF_SIZE))//||(xUSART1.ReceivedFlag==1 // 判断1: 当前帧已接收到的数据量，已满(缓存区), 为避免溢出，本包后面接收到的数据直接舍弃．
        {
            // 判断2: 如果之前接收好的数据包还没处理，就放弃新数据，即，新数据帧不能覆盖旧数据帧，直至旧数据帧被处理．缺点：数据传输过快于处理速度时会掉包；好处：机制清晰，易于调试
            USART6->DR;                                              // 读取数据寄存器的数据，但不保存．主要作用：读DR时自动清理接收中断标志；
            return;
        }
        rxTemp[cnt++] = USART6->DR ;                                 // 把新收到的字节数据，顺序存放到RXTemp数组中；注意：读取DR时自动清零中断位
        return;
    }

    // 空闲中断：用于判断一帧数据结束，整理数据到外部备读
    if (USART6->SR & (1 << 4))                                       // 检查IDLE(空闲中断标志位); IDLE中断标志清理方法：序列清零，USART1 ->SR;  USART1 ->DR;
    {
        xUSART6.ReceivedNum  = 0;                                    // 把接收到的数据字节数清0
        memcpy(xUSART6.ReceivedData, rxTemp, USART6_RX_BUF_SIZE);    // 把本帧接收到的数据，存放到全局变量xUSART.USARTxReceivedData中, 等待处理; 注意：复制的是整个数组，包括0值，以方便字符串数据
        xUSART6.ReceivedNum  = cnt;                                  // 把接收到的字节数，存放到全局变量xUSART.USARTxReceivedCNT中；
        cnt = 0;                                                     // 接收字节数累计器，清零; 准备下一次的接收
        memset(rxTemp, 0, USART6_RX_BUF_SIZE);                       // 接收数据缓存数组，清零; 准备下一次的接收
        USART6 ->SR;
        USART6 ->DR;                                                 // 清零IDLE中断标志位!! 序列清零，顺序不能错!!
        return;
    }

    return;
}


/******************************************************************************
 * 函  数： USART6_SendData
 * 功  能： USART通过中断发送数据
 *         【适合场景】本函数可发送各种数据，而不限于字符串，如int,char
 *         【不 适 合】注意h文件中所定义的发缓冲区大小、注意数据压入缓冲区的速度与串口发送速度的冲突
 * 参  数： uint8_t* buffer   需发送数据的地址
 *          uint8_t  num      发送的字节数 ，数量受限于h文件中设置的发送缓存区大小宏定义
 * 返回值： 无
 ******************************************************************************/
void USART6_SendData(uint8_t *buf, uint16_t num)
{
    for (uint16_t i = 0; i < num; i++)                      // 把数据放入环形缓冲区
    {
        xUSART6.txFiFoData[xUSART6.txFiFoHead++] = buf[i];  // 把字节放到缓冲区最后的位置，然后指针后移
        if (xUSART6.txFiFoHead == USART6_TX_BUF_SIZE)       // 如果指针位置到达缓冲区的最大值，则归0
            xUSART6.txFiFoHead = 0;
    }

    if ((USART6->CR1 & 1 << 7) == 0)                        // 检查USART寄存器的发送缓冲区空置中断(TXEIE)是否已打开
        USART6->CR1 |= 1 << 7;                              // 打开TXEIE中断
}

/******************************************************************************
 * 函  数： USART6_SendString
 * 功  能： 发送字符串
 *          用法请参考printf，及示例中的展示
 * 参  数： const char *mString, ...   不定长参数，请参考printf用法
 * 返回值： 无
 ******************************************************************************/
void USART6_SendString(const char *mString, ...)
{
    static char mBuffer[USART6_TX_BUF_SIZE];               // 开辟一个缓存; 只开辟一次，有效期直到程序结束; 缓存大小跟随发送环形缓冲区大小，在h文件中指定
    memset(mBuffer, 0, USART6_TX_BUF_SIZE);                // 清0缓存数据

    va_list ap;                                            // 新建一个可变参数列表
    va_start(ap, mString);                                 // 列表指向第一个可变参数
    vsnprintf(mBuffer, USART6_TX_BUF_SIZE, mString, ap);   // 把所有参数，按格式，输出到缓存
    va_end(ap);                                            // 清空可变参数列表

    uint8_t *mChar = (uint8_t *)mBuffer;                   // 新建一个指针，指向缓存
    while (*mChar)                                         // 逐个字节检查，如果不为'\0', 即非0
        USART6_SendData(mChar++, 1);                       // 把字节存放环形缓冲，排队准备发送
}

/******************************************************************************
 * 函  数： USART6_GetReceivedNum
 * 功  能： 获取最新一帧数据的字节数
 * 参  数： 无
 * 返回值： 0=没有接收到数据，非0=新一帧数据的字节数
 ******************************************************************************/
uint16_t USART6_GetReceivedNum(void)
{
    return xUSART6.ReceivedNum ;
}

/******************************************************************************
 * 函  数： USART6_GetReceivedData
 * 功  能： 获取最新一帧数据的缓存地址
 * 参  数： 无
 * 返回值： 数据的地址(uint8_t*)
 ******************************************************************************/
uint8_t *USART6_GetReceivedData(void)
{
    return xUSART6.ReceivedData ;
}

/******************************************************************************
 * 函  数： USART6_ClearReceived
 * 功  能： 清理最后一帧数据的缓存
 *          主要是清0字节数，因为它是用来判断接收的标准
 * 参  数： 无
 * 返回值： 无
 ******************************************************************************/
void USART6_ClearReceived(void)
{
    xUSART6.ReceivedNum = 0 ;
}
#endif   // END USART6





/////////////////////////////////////////////////////////////  辅助功能   /////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/******************************************************************************
 * 函  数： showData
 * 功  能： 把数据，经串口1，发送到串口助手上，方便观察
 * 参  数： uint8_t  *rxData   数据地址
 *          uint16_t  rxNum    字节数
 * 返回值： 无
 ******************************************************************************/
void showData(uint8_t *rxData, uint16_t rxNum)
{
#if 0                                                           // 写法1
    printf("字节数： %d \r", rxNum);                            // 显示字节数
    printf("ASCII 显示数据: %s\r", (char *)rxData);             // 显示数据，以ASCII方式显示，即以字符串的方式显示
    printf("16进制显示数据: ");                                 // 显示数据，以16进制方式，显示每一个字节的值
    while (rxNum--)                                             // 逐个字节判断，只要不为'\0', 就继续
        printf("0x%X ", *rxData++);                             // 格式化
    printf("\r\r");                                             // 显示换行
#else                                                           // 写法2
    USART1_SendString("字节数：%d \r", rxNum);                  // 显示字节数
    USART1_SendString("ASCII : %s\r", (char *)rxData);          // 显示数据，以ASCII方式显示，即以字符串的方式显示
    USART1_SendString("16进制: ");                              // 显示数据，以16进制方式，显示每一个字节的值
    while (rxNum--)                                             // 逐个字节判断，只要不为'\0', 就继续
        USART1_SendString("0x%X ", *rxData++);                  // 格式化
    USART1_SendString("\r\r");                                  // 显示换行
#endif
}





//////////////////////////////////////////////////////////////  printf   //////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************
 * 功  能： printf函数支持代码
 *         【特别注意】加入以下代码, 使用printf函数时, 不再需要选择use MicroLIB
 * 参  数：
 * 返回值：
 * 备  注： 最后修改_2020年07月15日
 ******************************************************************************/
// #pragma import(__use_no_semihosting)

// struct __FILE
// {
//     int handle;
// };                                         // 标准库需要的支持函数

// FILE __stdout;                             // FILE 在stdio.h文件
// void _sys_exit(int x)
// {
//     x = x;                                 // 定义_sys_exit()以避免使用半主机模式
// }

// int fputc(int ch, FILE *f)                 // 重定向fputc函数，使printf的输出，由fputc输出到UART,  这里使用串口1(USART1)
// {
// #if 0                                      // 方式1-使用常用的方式发送数据，比较容易理解，但等待耗时大  
//     while ((USART1->SR & 0X40) == 0);      // 等待上一次串口数据发送完成
//     USART1->DR = (u8) ch;                  // 写DR,串口1将发送数据
// #else
//     USART1_SendData((uint8_t *)&ch, 1);    // 方式2-使用队列+中断方式发送数据; 无需像方式1那样等待耗时，但要借助已写好的函数、环形缓冲
// #endif
//     return ch;
// }

